app/controllers/questionaires_controller.rb

INSERT INTO "questionaires" ("user_id", "first_question", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["first_question", "Who are you?"], ["created_at", 2016-08-09 18:53:37 UTC], ["updated_at", 2016-08-09 18:53:37 UTC]]
---
  def create
    @questionaire = Questionaire.new(questionaire_params)
    @questionaire.user_id = session[:user_id]
    @questionaire.save

SELECT  "questionaires".* FROM "questionaires" WHERE "questionaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @questionaire = Questionaire.find(params[:id])