app/controllers/users_controller.rb

  def create
    p params
    @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Christel"], ["last_name", "Trutmann"], ["email", "ctrutmann@solveme.com"], ["created_at", 2016-08-09 18:27:56 UTC], ["updated_at", 2016-08-09 18:27:56 UTC]]